In [54]:
import pandas as pd
import numpy as np

In [42]:
students = [{
    'Name': 'Inam',
    'Age': 42
},
{
    'Name': 'Ali',
    'Age': 22,
    'Course': 'AI'
},{
    'Name': 'Daniyal',
    'Age': 42,
    'Course': 'CNCF'
},{
    'Name': 'Mohsin',    
    'Course': 'CNCF'
},{
    'Name': 'Aamir',
    'Age': 22
},{
    'Name': 'Aamir',
    'Age': 22
},{
    'Name': 'Aamir',
    'Age': 22,
    'Course': 'CNCF'
}]

In [43]:
students_df = pd.DataFrame(students)
students_df

    Age Course     Name
0  42.0    NaN     Inam
1  22.0     AI      Ali
2  42.0   CNCF  Daniyal
3   NaN   CNCF   Mohsin
4  22.0    NaN    Aamir
5  22.0    NaN    Aamir
6  22.0   CNCF    Aamir

In [15]:
students_df.notnull()

     Age  Course  Name
0   True    True  True
1   True    True  True
2   True    True  True
3  False    True  True
4   True   False  True

In [17]:
dropped_df = students_df.dropna()
dropped_df

    Age Course     Name
0  42.0     AI     Inam
1  22.0     AI      Ali
2  42.0   CNCF  Daniyal

In [18]:
students_df

    Age Course     Name
0  42.0     AI     Inam
1  22.0     AI      Ali
2  42.0   CNCF  Daniyal
3   NaN   CNCF   Mohsin
4  22.0    NaN    Aamir

In [45]:
filled_df = students_df.fillna({'Age': students_df['Age'].mean(), 'Course': 'Un-Known'})
filled_df

         Age    Course     Name
0  42.000000  Un-Known     Inam
1  22.000000        AI      Ali
2  42.000000      CNCF  Daniyal
3  28.666667      CNCF   Mohsin
4  22.000000  Un-Known    Aamir
5  22.000000  Un-Known    Aamir
6  22.000000      CNCF    Aamir

In [46]:
filled_df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [41]:
droped_dup_df = filled_df.drop_duplicates(keep='last')
droped_dup_df

    Age    Course     Name
0  42.0  Un-Known     Inam
1  22.0        AI      Ali
2  42.0      CNCF  Daniyal
3  30.0      CNCF   Mohsin
5  22.0  Un-Known    Aamir

In [52]:
twice_age = droped_dup_df['Age'].map(lambda val: val * 2)
twice_age

0    84.0
1    44.0
2    84.0
3    60.0
5    44.0
Name: Age, dtype: float64

In [61]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'], 
            columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [67]:
data = data.rename(index=str.title, columns=str.upper)
data

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [73]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]